turbulence_2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2.5;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  on;

maxCo           1;
maxAlphaCo      1;

maxDeltaT       1;

functions
{
     interfaceHeight1
     {
          type	interfaceHeight;
          libs	("libfieldFunctionObjects.so");
          alpha	alpha.water;
          locations	((0.3 0 0) (0.865 0 0) (1.114 0 0) (1.3625 0 0));
     }
     gaugesSurge
     {
         type    sets;
         libs ("libsampling.so");
         writeControl    outputTime;
         writeInterval   1;
         setFormat       raw;
         surfaceFormat   raw;
         interpolationScheme cell;
         outputControl   timeStep;
         outputInterval  1;
         fields          ( alpha.water );
         sets
         (
             GaugeVOF01
             {
                 type    lineCellFace;
                 axis    xyz;
                 start   (0 0.005 0);
                 end     (1.610 0.005 0);
             }
         );
     } 
    #include "forces"
}

// ************************************************************************* //
