turbulence_2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

H 300;

D 600;
A 1010;
B 600;
L 1616;
H1 300;
H2 865;
H3 1114;
H4 1362.5;
z1 3;
z2 15;
z3 30;
z4 80;
W 150;
z2L 15;
y2L 37.5;
cellwidth 10;

vertices
(
    (0 0 0)     //  0
    ($B 0 0)    //  1	    
    ($L 0 0)    //  2	    
    (0 0 $D)    //  3	    
    ($B 0 $D)   //  4	    
    ($L 0 $D)   //  5	    
    (0 $cellwidth 0)     //  6	    
    ($B $cellwidth 0)    //  7	    
    ($L $cellwidth 0)    //  8	    
    (0 $cellwidth $D)    //  9	    
    ($B $cellwidth $D)   // 10	    
    ($L $cellwidth $D)   // 11	    
);

blocks
(
    hex (0 1 7 6 3 4 10 9) (100 1 80) simpleGrading (1 1 1)
    hex (1 2 8 7 4 5 11 10) (200 1 80) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 3 9 6)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (2 8 11 5)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (6 7 1 0)
            (7 8 2 1)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (3 4 10 9)
            (4 5 11 10)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
