turbulence_2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       47620;
    }
    rightWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       47700;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       47780;
    }
    atmosphere
    {
        type            patch;
        nFaces          300;
        startFace       48080;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          48000;
        startFace       48380;
    }
)

// ************************************************************************* //
